
// a=[0,0,0] // مبدا
// // b=[0,0,0] // پله مبدا
// d=[0,0,0] // پله مقصد
// c=[0,0,0] // مقصد

// if 





// // -------------------------------- 


// const data={
//     "path": {[
//         [147,667],
//         [147,567],
//         [147,467],
//         [147,367],
//         [147,267],
//         [204,223],
//         "floor-num":1,
//     ],
//     [
//         [204,223],
//         "floor-num":2,
//     ],
//     [
//         [204,223],
//         [147,567],
//         [147,467],
//         [147,367],
//         [147,267],
//         [204,223],
//         "floor-num":3
//     ]}
// }




// //---------------


// const data1 ={
//     stand:[
//         {info:"no",x:23,y:34,floorNumber:-1,isMe:true},
//         {info:"we",x:45,y:86,floorNumber:3,isMe:false}
// ],
//     floors:[
//         {number:-2,name:'pw2',file:'pw2.glb'},
//         [-1,'pw1','pw1.glb'],
//         [0,'G','G.glb'],
//         [1,'f1','f1.glb'],
//         [2,'f2','f2.glb'],
//         [3,'foodcored','foodcored.glb'],
//     ]
// }

